       IDENTIFICATION DIVISION.
       PROGRAM-ID. CHAOS.

       PROCEDURE DIVISION.
           PERFORM 50 TIMES
               DISPLAY "I willingly installed COBOL in 2026"
               CONTINUE AFTER 1 SECONDS
           END-PERFORM.
           STOP RUN.
